---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateMonolithicStairs
source: html/f857fbbd-4f79-57e3-c8e8-e2ca7e3b36c1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotCreateMonolithicStairs Property

Can't make monolithic Stairs.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateMonolithicStairs { get; }
```